---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelStickElementsMark
source: html/edc0fdc0-590e-bb72-9607-e475bff396a4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelStickElementsMark Property

"Member Number": Used for beams, braces, columns

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelStickElementsMark { get; }
```